; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_12 ?v9 ?v3)
             (pred_2 ?v12 ?v8)
             (pred_11 ?v9 ?v8)
             (pred_1 ?v6 ?v9 )
	     (pred_4 ?v9)
             (pred_7 ?v7)
             (pred_3 ?v12)
             (pred_6 ?v8)
             (pred_8 ?v9)
             (pred_9 ?v12)
             (pred_5 ?v9)
             (pred_10 ))



(:action op_1
:parameters (?v5 ?v10 ?v11 ?v2)
:precondition (and (pred_7 ?v5) (pred_7 ?v10) (pred_3 ?v11) (pred_6 ?v2)
          (pred_12 ?v5 ?v10) (pred_2 ?v11 ?v2)
                   (pred_11 ?v10 ?v2) (pred_4 ?v5) 
                   (pred_8 ?v10) (pred_9 ?v11))
:effect (and  (pred_5 ?v10) (not (pred_8 ?v10))))


(:action op_3
:parameters (?v5 ?v1)
:precondition (and (pred_7 ?v5) (pred_7 ?v1)
               (pred_4 ?v5) (pred_12 ?v5 ?v1) (pred_5 ?v1))
:effect (and (pred_4 ?v1) (not (pred_4 ?v5))))

(:action op_5
:parameters (?v5 ?v11)
:precondition (and (pred_7 ?v5) (pred_3 ?v11) 
                  (pred_4 ?v5) (pred_1 ?v11 ?v5) (pred_10 ))
:effect (and (pred_9 ?v11)
   (not (pred_1 ?v11 ?v5)) (not (pred_10 ))))


(:action op_2
:parameters (?v5 ?v13 ?v4)
:precondition (and (pred_7 ?v5) (pred_3 ?v13) (pred_3 ?v4)
                  (pred_4 ?v5) (pred_9 ?v4) (pred_1 ?v13 ?v5))
:effect (and (pred_9 ?v13) (pred_1 ?v4 ?v5)
        (not (pred_9 ?v4)) (not (pred_1 ?v13 ?v5))))

(:action op_4
:parameters (?v5 ?v11)
:precondition (and (pred_7 ?v5) (pred_3 ?v11) 
                  (pred_4 ?v5) (pred_9 ?v11))
:effect (and (pred_10 ) (pred_1 ?v11 ?v5) (not (pred_9 ?v11)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_21 obj_16 obj_11 obj_19 obj_13 obj_07 obj_05 obj_14 obj_08 obj_18 obj_03 obj_17 obj_04 obj_15 obj_10 obj_06
    obj_02 obj_09
    obj_01 obj_20 obj_12
    )

    (:init
       (pred_10)

       (pred_7 obj_21)
       (pred_7 obj_16)
       (pred_7 obj_11)
       (pred_7 obj_19)
       (pred_7 obj_13)
       (pred_7 obj_07)
       (pred_7 obj_05)
       (pred_7 obj_14)
       (pred_7 obj_08)
       (pred_7 obj_18)
       (pred_7 obj_03)
       (pred_7 obj_17)
       (pred_7 obj_04)
       (pred_7 obj_15)
       (pred_7 obj_10)
       (pred_7 obj_06)
       (pred_6 obj_02)
       (pred_6 obj_09)
       (pred_3 obj_01)
       (pred_3 obj_20)
       (pred_3 obj_12)

       (pred_12 obj_21 obj_13)
       (pred_12 obj_21 obj_16)
       (pred_12 obj_16 obj_07)
       (pred_12 obj_16 obj_11)
       (pred_12 obj_16 obj_21)
       (pred_12 obj_11 obj_05)
       (pred_12 obj_11 obj_19)
       (pred_12 obj_11 obj_16)
       (pred_12 obj_19 obj_14)
       (pred_12 obj_19 obj_11)
       (pred_12 obj_13 obj_08)
       (pred_12 obj_13 obj_07)
       (pred_12 obj_13 obj_21)
       (pred_12 obj_07 obj_18)
       (pred_12 obj_07 obj_05)
       (pred_12 obj_07 obj_16)
       (pred_12 obj_07 obj_13)
       (pred_12 obj_05 obj_03)
       (pred_12 obj_05 obj_14)
       (pred_12 obj_05 obj_11)
       (pred_12 obj_05 obj_07)
       (pred_12 obj_14 obj_17)
       (pred_12 obj_14 obj_19)
       (pred_12 obj_14 obj_05)
       (pred_12 obj_08 obj_04)
       (pred_12 obj_08 obj_18)
       (pred_12 obj_08 obj_13)
       (pred_12 obj_18 obj_15)
       (pred_12 obj_18 obj_03)
       (pred_12 obj_18 obj_07)
       (pred_12 obj_18 obj_08)
       (pred_12 obj_03 obj_10)
       (pred_12 obj_03 obj_17)
       (pred_12 obj_03 obj_05)
       (pred_12 obj_03 obj_18)
       (pred_12 obj_17 obj_06)
       (pred_12 obj_17 obj_14)
       (pred_12 obj_17 obj_03)
       (pred_12 obj_04 obj_15)
       (pred_12 obj_04 obj_08)
       (pred_12 obj_15 obj_10)
       (pred_12 obj_15 obj_18)
       (pred_12 obj_15 obj_04)
       (pred_12 obj_10 obj_06)
       (pred_12 obj_10 obj_03)
       (pred_12 obj_10 obj_15)
       (pred_12 obj_06 obj_17)
       (pred_12 obj_06 obj_10)
       (pred_8 obj_08)
       (pred_8 obj_19)
       (pred_8 obj_07)
       (pred_11  obj_08 obj_02)
       (pred_11  obj_19 obj_09)
       (pred_11  obj_07 obj_02)
       (pred_5 obj_21)
       (pred_5 obj_16)
       (pred_5 obj_11)
       (pred_5 obj_13)
       (pred_5 obj_05)
       (pred_5 obj_14)
       (pred_5 obj_18)
       (pred_5 obj_03)
       (pred_5 obj_17)
       (pred_5 obj_04)
       (pred_5 obj_15)
       (pred_5 obj_10)
       (pred_5 obj_06)

       (pred_2  obj_01 obj_02)
       (pred_2  obj_20 obj_09)
       (pred_2  obj_12 obj_09)
       (pred_1 obj_01 obj_03)
       (pred_1 obj_20 obj_18)
       (pred_1 obj_12 obj_15)
       (pred_4 obj_15)
    )

    (:goal (and
       (pred_1 obj_01 obj_06)
    ))
(:constraints
  (always (not (pred_4 obj_10)))
)
)

; plan
1. (op_3 obj_15 obj_18)
   deleted: (pred_4 obj_15)
   added: (pred_4 obj_18)
   goals met: 0 of 1
2. (op_3 obj_18 obj_03)
   deleted: (pred_4 obj_18)
   added: (pred_4 obj_03)
   goals met: 0 of 1
3. (op_5 obj_03 obj_01)
   deleted: (pred_1 obj_01 obj_03) (pred_10)
   added: (pred_9 obj_01)
   goals met: 0 of 1
4. (op_3 obj_03 obj_17)
   deleted: (pred_4 obj_03)
   added: (pred_4 obj_17)
   goals met: 0 of 1
5. (op_3 obj_17 obj_06)
   deleted: (pred_4 obj_17)
   added: (pred_4 obj_06)
   goals met: 0 of 1
6. (op_4 obj_06 obj_01)
   deleted: (pred_9 obj_01)
   added: (pred_10) (pred_1 obj_01 obj_06)
   goals met: 1 of 1
